Revit 2027 API
ExtendedPropertiesLink.GetAllAssociatedPropertyIds Method
 Retrieves all ids, each corresponding to a [!:Autodesk::Revit::DB::ExternalData::ExtendedParameterElement] associated with this link.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetAllAssociatedPropertyIds()
Public Function GetAllAssociatedPropertyIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetAllAssociatedPropertyIds()
member GetAllAssociatedPropertyIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
See Also
Reference
ExtendedPropertiesLink Class
Autodesk.Revit.DB.ExternalData Namespace